{
  "name": "Joeseph Rodrigues",
  "contactMethods": [
    {
      "method": "phone",
      "color":"#1DB954",
      "text": "1-415-354-8766",
      "url": "tel:1-415-364-8766",
      "prefix": "fas"
    },
    {
      "method": "envelope",
      "color": "#dd4b39",
      "text": "dowhilegeek@gmail.com",
      "url": "mailto:dowhilegeek@gmail.com",
      "prefix": "fas"
    },
    {
      "method": "github",
  "color":"#333",
      "text": "/dowhilegeek",
      "url": "https://github.com/dowhilegeek",
      "prefix": "fab",
      "newTab": "true"
    },
    {
      "method": "linkedin",
      "color": "#0077b5",
      "text": "/in/joesephrodrigues",
      "url": "https://linkedin.com/in/joesephrodrigues",
      "prefix": "fab",
      "newTab": "true"
    }
  ],

skills: {
  "Languages": [
    {
      "skill": "Nodejs",
      "level": 3
    },
    {
      "skill": "Python",
      "level": 3
    },
    {
      "skill": "HTML/CSS/JS",
      "level": 3
    },
    {
      "skill": "Rust",
      "level": 2
    },
    {
      "skill": "C/C++",
      "level": 1
    }
  ],
  "Frameworks": [
    {
      "skill": "React",
      "level": 3
    },
    {
      "skill": "React Native",
      "level": 3
    },
    {
      "skill": "GraphQL",
      "level": 3
    },
    {
      "skill": "Express",
      "level": 3
    },
    {
      "skill": "Flask",
      "level": 3
    }
  ],
  "Databases": [
    {
      "skill": "PostgreSQL",
      "level": 3
    },
    {
      "skill": "MongoDB",
      "level": 2
    },
    {
      "skill": "Couchbase",
      "level": 1
    },
    {
      "skill": "DynamoDB",
      "level": 2
    },
    {
      "skill": "MySQL",
      "level": 3
    }
  ],
  "Infrastructure": [
    {
      "skill": "AWS",
      "level": 3
    },
    {
      "skill": "Docker",
      "level": 3
    },
    {
      "skill": "Serverless",
      "level": 2
    },
    {
      "skill": "Kubernetes",
      "level": 1
    }
  ]
},
  "experiences": [
    {
      "title": "Sr Full-Stack Engineer",
      "company": "Full Stack Labs",
      "dateRange": "May 2019 - Present",
      "accomplishments": [
        "Led development on, and managed four teams in building seven backend microservices for the modernization efforts to the California Department Of Healthcare Services. This was a first of its kind project in state projects using Nodejs, koa, and es6, all secured with JWT.",
        "Mentored 20+ Java and .NET developers on modern, fullstack javascript, as well as the concept of database migrations. I was a required approval on most backend pull requests, especially when a database migration was involved, on account of the amount of steering required.",
        "Before being put in charge of the microservices, I was a major contributor to the React frontend that consumed the microservices, and paired with team members often to show them best practices on a modern javascript frontend."
      ],
      "unusedBulletPoint": "Was the sole dev-ops asset until the dev-ops team was staffed. This included configuring the ci pipeline for all repositories, publishing shared internal packages to private npm registry, and maintaining a docker-compose config to stand up all services, ui, and their respective databases for ease of local development."
    },
    {
      "title": "Sr Full-Stack Engineer",
      "company": "Omadi",
      "dateRange": "August 2017 - May 2019",
      "accomplishments": [
        "Built a React Native app from conception to delivery to the user, and mentored jr engineers along the way.",
        "Major contributor in building a React web app that worked in tandem with the React Native app.",
        "Spearheaded the company transition to GraphQL running on Serverless in multiple company verticals, teaching new teams as they were brought online."
      ]
    },
    {
      "title": "Full-Stack Engineer",
      "company": "Authentise",
      "dateRange": "April 2014 - August 2017",
      "accomplishments": [
        "Pitched to management, built, and maintained an end-user accessable \"3d Model Warehouse\" api that: stored, raytrace rendered, transformed, ran a suite of printability checks, and repaired the model on demand.",
        "Pitched to management, built, and maintained an end-user accessable \"Slicing Service\" api that would take model resources from the model warehouse, and \"sliced\" (generated a toolpath) that could be 3d printed.",
        "Worked with a team to build an OpenCV api that would take pictures of a 3d print in-situ and compare it against an ideal rendering of the toolpath, and emailed the user if their print began to fail.",
        "Contributed Full Stack in building a Enterprise Resource Planning system for the 3d printing industry.",
        "Worked with a team to build a robust, bi-directional 3rd party integration service for all above listed services."
      ]
    },
    {
      "title": "Backend/Firmware Engineer",
      "company": "Ansync",
      "dateRange": "July 2013 - November 2013",
      "accomplishments": [
        "Wrote device firmware in C to talk to companion NodeJS apps.",
        "Contributed to various software/mechanical engineering projects.",
        "Worked SMT line at every stage from bare PCB's to final QA.",
        "Operated and maintained 3 & 5 axis cnc end mills, laser-cutter, and various shop tools."
      ]
    },
    {
      "title": "Android Engineer",
      "company": "Ask Ziggy",
      "dateRange": "July 2012 - May 2013",
      "accomplishments": [
        "Developed and designed Android prototypes in rapid sprint cycles for prospective businesses and investors. Most taking advantage of natural language understanding (siri- like ai).",
        "Wrote server & automation scripts in python to interact with Android applications.",
        "Designed custom circuits for proof of concept of products, as well as 3d model objects and print them out for rapid prototyping of mechanical concepts."
      ]
    }
  ]
}
